NextFOAM-2401/tutorials/combustion/XiDyMFoam/oscillatingCylinder/0.orig/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    "(walls|cylinder)"
    {
        type            zeroGradient;
    }

    "inlet.*"
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
